frontend/controllers/CiaController.php

                                        $cveDetailsModel->integrity = trim($integrity);
                                        $cveDetailsModel->availability = trim($availability);
                                        $cveDetailsModel->description = trim($description);
                                        $id = $cveDetailsModel->save(false);
---
INSERT INTO `tool_cve_details` (`product`, `cve`, `vulnerability`, `conf`, `integrity`, `availability`, `description`) VALUES ('Zend', 'CVE-2015-5161', 'Bypass', 'Partial', 'Partial', 'Partial', 'The Zend_Xml_Security::scan in ZendXml before 1.0.1 and Zend Framework before 1.12.14, 2.x before 2.4.6, and 2.5.x before 2.5.2, when running under PHP-FPM in a threaded environment, allows remote attackers to bypass security checks and conduct XML external entity (XXE) and XML entity expansion (XEE) attacks via multibyte encoded characters.')